jimmywong2003/nrf5-hrs-central-to-2-peripheral-with-bonding-freeRtos/ble_app_hrs_c/main.c
/** @brief Clear bonding information from persistent storage
 */
static void delete_bonds(void)
{
        ret_code_t err_code;

        NRF_LOG_INFO("Erase bonds!");

        err_code = pm_peers_delete();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for disabling the use of whitelist for scanning.
 */
static void whitelist_disable(void)
{
        if (!m_whitelist_disabled)
        {
                NRF_LOG_INFO("Whitelist temporarily disabled.");
                m_whitelist_disabled = true;
                nrf_ble_scan_stop();
                scan_start();
        }
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
        ret_code_t err_code;

        switch (event)
        {
        case BSP_EVENT_SLEEP:
                nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
                break;

        case BSP_EVENT_DISCONNECT:
                err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                        APP_ERROR_CHECK(err_code);
                }
                break;

        case BSP_EVENT_WHITELIST_OFF:
                whitelist_disable();
                break;

        default:
                break;
        }
}


/**@brief Heart Rate Collector Handler.
 */
static void hrs_c_evt_handler(ble_hrs_c_t * p_hrs_c, ble_hrs_c_evt_t * p_hrs_c_evt)
{
        ret_code_t err_code;

        switch (p_hrs_c_evt->evt_type)
        {
        case BLE_HRS_C_EVT_DISCOVERY_COMPLETE:
        {
                //NRF_LOG_DEBUG("Heart rate service discovered.");
                NRF_LOG_INFO("Heart Rate Service discovered on conn_handle 0x%x",
                             p_hrs_c_evt->conn_handle);

                err_code = ble_hrs_c_handles_assign(p_hrs_c,
                                                    p_hrs_c_evt->conn_handle,
                                                    &p_hrs_c_evt->params.peer_db);
                APP_ERROR_CHECK(err_code);

                // Initiate bonding.
                err_code = pm_conn_secure(p_hrs_c_evt->conn_handle, false);
                if (err_code != NRF_ERROR_BUSY)
                {
                        APP_ERROR_CHECK(err_code);
                }

                // Heart rate service discovered. Enable notification of Heart Rate Measurement.
                err_code = ble_hrs_c_hrm_notif_enable(p_hrs_c);
                APP_ERROR_CHECK(err_code);
        } break;

        case BLE_HRS_C_EVT_HRM_NOTIFICATION:
        {
                NRF_LOG_INFO("Heart Rate = %d.", p_hrs_c_evt->params.hrm.hr_value);

                if (p_hrs_c_evt->params.hrm.rr_intervals_cnt != 0)
                {
                        uint32_t rr_avg = 0;
                        for (uint32_t i = 0; i < p_hrs_c_evt->params.hrm.rr_intervals_cnt; i++)
                        {
                                rr_avg += p_hrs_c_evt->params.hrm.rr_intervals[i];
                        }
                        rr_avg = rr_avg / p_hrs_c_evt->params.hrm.rr_intervals_cnt;
                        NRF_LOG_DEBUG("rr_interval (avg) = %d.", rr_avg);
                }
        } break;

        default:
                break;
        }
}


/**@brief Battery level Collector Handler.
 */
static void bas_c_evt_handler(ble_bas_c_t * p_bas_c, ble_bas_c_evt_t * p_bas_c_evt)
{
        ret_code_t err_code;

        switch (p_bas_c_evt->evt_type)
        {
        case BLE_BAS_C_EVT_DISCOVERY_COMPLETE:
        {
                err_code = ble_bas_c_handles_assign(p_bas_c,
                                                    p_bas_c_evt->conn_handle,
                                                    &p_bas_c_evt->params.bas_db);
                APP_ERROR_CHECK(err_code);

                // Battery service discovered. Enable notification of Battery Level.
                NRF_LOG_INFO("Battery Service discovered. Reading battery level.");

                err_code = ble_bas_c_bl_read(p_bas_c);
                APP_ERROR_CHECK(err_code);

                NRF_LOG_DEBUG("Enabling Battery Level Notification.");
                err_code = ble_bas_c_bl_notif_enable(p_bas_c);
                APP_ERROR_CHECK(err_code);

        } break;

        case BLE_BAS_C_EVT_BATT_NOTIFICATION:
                NRF_LOG_INFO("Battery Level received %d %%.", p_bas_c_evt->params.battery_level);
                break;

        case BLE_BAS_C_EVT_BATT_READ_RESP:
                NRF_LOG_INFO("Battery Level Read as %d %%.", p_bas_c_evt->params.battery_level);
                break;

        default:
                break;
        }
}


/**
 * @brief Heart rate collector initialization.
 */
static void hrs_c_init(void)
{
        ret_code_t err_code;
        ble_hrs_c_init_t hrs_c_init_obj;

        hrs_c_init_obj.evt_handler = hrs_c_evt_handler;

        for (uint32_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
        {
                // ret_code_t err_code = ble_hrs_c_init(&m_hrs_c, &hrs_c_init_obj);
                // APP_ERROR_CHECK(err_code);
                ret_code_t err_code = ble_hrs_c_init(&m_ble_hrs_c[i], &hrs_c_init_obj);
                APP_ERROR_CHECK(err_code);

        }
}


/**
 * @brief Battery level collector initialization.
 */
static void bas_c_init(void)
{
        ble_bas_c_init_t bas_c_init_obj;
        ret_code_t err_code = NRF_SUCCESS;

        bas_c_init_obj.evt_handler = bas_c_evt_handler;

        for (uint32_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
        {
                ret_code_t err_code = ble_bas_c_init(&m_ble_bas_c[i], &bas_c_init_obj);
                APP_ERROR_CHECK(err_code);
        }
}


/**
 * @brief Database discovery collector initialization.
 */
static void db_discovery_init(void)
{
        ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
        APP_ERROR_CHECK(err_code);
}


/**@brief Retrieve a list of peer manager peer IDs.
 *
 * @param[inout] p_peers   The buffer where to store the list of peer IDs.
 * @param[inout] p_size    In: The size of the @p p_peers buffer.
 *                         Out: The number of peers copied in the buffer.
 */
static void peer_list_get(pm_peer_id_t * p_peers, uint32_t * p_size)
{
        pm_peer_id_t peer_id;
        uint32_t peers_to_copy;

        peers_to_copy = (*p_size < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) ?
                        *p_size : BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

        peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);
        *p_size = 0;

        while ((peer_id != PM_PEER_ID_INVALID) && (peers_to_copy--))
        {
                p_peers[(*p_size)++] = peer_id;
                peer_id = pm_next_peer_id_get(peer_id);
        }
}


static void whitelist_load()
{
        ret_code_t ret;
        pm_peer_id_t peers[8];
        uint32_t peer_cnt;

        memset(peers, PM_PEER_ID_INVALID, sizeof(peers));
        peer_cnt = (sizeof(peers) / sizeof(pm_peer_id_t));

        // Load all peers from flash and whitelist them.
        peer_list_get(peers, &peer_cnt);

        ret = pm_whitelist_set(peers, peer_cnt);
        APP_ERROR_CHECK(ret);

        // Setup the device identies list.
        // Some SoftDevices do not support this feature.
        ret = pm_device_identities_list_set(peers, peer_cnt);
        if (ret != NRF_ERROR_NOT_SUPPORTED)
        {
                APP_ERROR_CHECK(ret);
        }
}


static void on_whitelist_req(void)
{
        ret_code_t err_code;

        // Whitelist buffers.
        ble_gap_addr_t whitelist_addrs[8];
        ble_gap_irk_t whitelist_irks[8];

        memset(whitelist_addrs, 0x00, sizeof(whitelist_addrs));
        memset(whitelist_irks,  0x00, sizeof(whitelist_irks));

        uint32_t addr_cnt = (sizeof(whitelist_addrs) / sizeof(ble_gap_addr_t));
        uint32_t irk_cnt  = (sizeof(whitelist_irks)  / sizeof(ble_gap_irk_t));

        // Reload the whitelist and whitelist all peers.
        whitelist_load();

        // Get the whitelist previously set using pm_whitelist_set().
        err_code = pm_whitelist_get(whitelist_addrs, &addr_cnt,
                                    whitelist_irks,  &irk_cnt);

