jimmywong2003/nrf5-hrs-central-to-2-peripheral-with-bonding-freeRtos/ble_app_hrs_c/main.c
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details Handle any pending log operation(s), then sleep until the next event occurs.
 */
static void idle_state_handle(void)
{
        ret_code_t err_code;

        // err_code = nrf_ble_lesc_request_handler();
        // APP_ERROR_CHECK(err_code);
        app_sched_execute();
        if (NRF_LOG_PROCESS() == false)
        {
                nrf_pwr_mgmt_run();
        }
}


/**@brief Function for starting a scan, or instead trigger it from peer manager (after
 *        deleting bonds).
 *
 * @param[in] p_erase_bonds Pointer to a bool to determine if bonds will be deleted before scanning.
 */
void scanning_start(bool * p_erase_bonds)
{
        // Start scanning for peripherals and initiate connection
        // with devices that advertise GATT Service UUID.
        if (*p_erase_bonds == true)
        {
                // Scan is started by the PM_EVT_PEERS_DELETE_SUCCEEDED event.
                delete_bonds();
        }
        else
        {
                scan_start();
        }
}

/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
        APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

int main(void)
{
        bool erase_bonds;

        // Initialize.
        log_init();
        timer_init();
        power_management_init();
        buttons_leds_init(&erase_bonds);
        ble_stack_init();
        scheduler_init();
        gatt_init();
        peer_manager_init();
        db_discovery_init();
        ble_conn_state_init();
        hrs_c_init();
        bas_c_init();
        scan_init();

        // Start execution.
        NRF_LOG_INFO("Heart Rate collector example started.");
        scanning_start(&erase_bonds);

        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }
}
